ka2_2024/src/DataProcessors/ПомощникФормированияКУДиР/ПомощникФормированияКУДиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникФормированияКУДиР</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ka2_2024/src/Documents/ЗаписьКУДиР/ЗаписьКУДиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьКУДиР</name>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел2</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Строки</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа5</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияДоходовРасходов</name>
      <type>
        <types>DocumentRef.ВнутреннееПотребление</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ДвижениеПрочихАктивовПассивов</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПоступлениеУслугПоАренде</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
        <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
        <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
        <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ВводОстатковТоваров</types>
        <types>CatalogRef.ДоговорыАренды</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.РегламентнаяОперация</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.ПрочееОприходованиеТоваров</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
        <types>DocumentRef.ОтчетПереработчика2_5</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.ПорчаТоваровУХранителя</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>EnumRef.ВидыРасходовУСН</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
        <types>EnumRef.ВидыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходЕНВД</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходЕНВД</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВнутреннееПотребление</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ВводОстатковТоваров</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетПереработчика2_5</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.ЗаключениеДоговораАренды</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходПатент</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Патент</name>
      <type>
        <types>CatalogRef.Патенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УменьшениеНалога</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПФР</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФОМС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС_НС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Больничные</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобровольноеСтрахование</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Строки2</name>
    <attributes>
      <name>ЭлементРасходов</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияРасходов</name>
      <type>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа3_ДатаВводаВЭксплуатацию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4_ГосударственнаяРегистрация</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа5_ПервоначальнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6_ОстаточнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7_СрокПолезногоИспользования</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа8_КолКварталовВОтчетномПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа9_КолКварталовВНалПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа10_ДоляРасходовЗаНалПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа11_ДоляРасходовЗаКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа12_СуммаРасходовЗаОтчетнПериод</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа13_СуммаРасходовЗаКвартал</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа14_РасходыПрошлыхПериодов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа15_ОстатокРасходов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа16_ДатаВыбытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УплаченныйТорговыйСбор</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТорговогоСбора</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Catalogs/Патенты/Патенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Патенты</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПатента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрименениеПатента</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/DataProcessors/ПомощникФормированияКУДиР/Forms/ФормаНастройкиПатентов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация", Объект.Организация);
	Параметры.Свойство("Период", Период);
	
	УстановитьСписокОрганизацийНаУСНЗаПериод(Элементы.Организация.СписокВыбора, Период.ДатаНачала, Период.ДатаОкончания, Объект.Организация);
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжиданияОтборыПоПатентам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();

КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();

КонецПроцедуры

&НаКлиенте
Процедура СтрокаВыбораПатентаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВыборИзСписка" Тогда
		СтандартнаяОбработка = Ложь;
		ОбработкаОповещения = Новый ОписаниеОповещения("ВыборПатента", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОбработкаОповещения, СписокПатентов, Элемент);
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "ВыбратьПатент") Тогда
		СтандартнаяОбработка = Ложь;
		ИндексСпискаПатентов = Число(СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "ВыбратьПатент", ""));
		ЗначениеПатента = СписокПатентов.Получить(ИндексСпискаПатентов);
		УстановитьОтборПоПатенту(ЗначениеПатента);
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "ВыбратьВсеДокументы") Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаВыбораПатента = СтрокаВыбораПатента(ОбщиеНастройкиПатентов, СписокПатентов);
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументов.Отбор, "Патент", , , Ложь);
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "ВыбратьБезПатента") Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаВыбораПатента = СтрокаВыбораПатента(ОбщиеНастройкиПатентов, СписокПатентов, "БезПатента");
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументов.Отбор, "Патент", , ВидСравненияКомпоновкиДанных.НеЗаполнено, Истина);
	ИначеЕсли СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, "ВыбратьСПатентом") Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаВыбораПатента = СтрокаВыбораПатента(ОбщиеНастройкиПатентов, СписокПатентов, "СПатентом");
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументов.Отбор, "Патент", , ВидСравненияКомпоновкиДанных.Заполнено, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элементы.СписокДокументов.ТекущиеДанные.ДокументВозникновенияДоходов);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);	
	ОбщегоНазначенияУтКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСумму(Команда)
	
	ИмяОперации = "СписокДокументов";
		
	Если Элементы[ИмяОперации].ВыделенныеСтроки.Количество() Тогда
		ИдентификаторСтроки = Элементы[ИмяОперации].ВыделенныеСтроки.Получить(0);
		ТекСтрока = Элементы[ИмяОперации].ДанныеСтроки(ИдентификаторСтроки);
		ПараметрыУстановкиСуммы = Новый Структура("ДокументВозникновенияДоходов, РеквизитыПервичногоДокумента, Патент");
		ЗаполнитьЗначенияСвойств(ПараметрыУстановкиСуммы, ТекСтрока);
		ПараметрыУстановкиСуммы.Вставить("КлючЗаписи", Элементы.СписокДокументов.ТекущаяСтрока);
		ВводЧислаЗавершение = Новый ОписаниеОповещения("УстановитьСуммуЗавершение", ЭтотОбъект, ПараметрыУстановкиСуммы);
		СуммаПатента = ТекСтрока.СуммаПатент;
		ПоказатьВводЧисла(ВводЧислаЗавершение, СуммаПатента, НСтр("ru = 'Сумма доходов по патенту'"), 15, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПатент(Команда)
	Если Элементы.СписокДокументов.ВыделенныеСтроки.Количество() Тогда
		ИдентификаторСтроки = Элементы.СписокДокументов.ВыделенныеСтроки.Получить(0);
		ТекСтрока = Элементы.СписокДокументов.ДанныеСтроки(ИдентификаторСтроки);
		ДополнительныеПараметры = Новый Структура("ДокументВозникновенияДоходов, РеквизитыПервичногоДокумента, Патент");
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ТекСтрока);
		ДополнительныеПараметры.Вставить("КлючЗаписи", Элементы.СписокДокументов.ТекущаяСтрока);
		ВыборПатентаЗавершение = Новый ОписаниеОповещения("УказатьПатентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыВыбора = Новый Структура("Организация, Подразделение, Период");
		ЗаполнитьЗначенияСвойств(ПараметрыВыбора, ТекСтрока);
		ПараметрыВыбора.Организация = Объект.Организация;
		ПараметрыВыбора.Период = ТекСтрока.ДатаДокументаИБ;
		ОткрытьФорму("Справочник.Патенты.Форма.ФормаВыбора", ПараметрыВыбора, Команда, , , , ВыборПатентаЗавершение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Возврат;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСписокОрганизацийНаУСНЗаПериод(СписокОрганизаций, НачалоПериода, КонецПериода, ТекущаяОрганизация)
	
	Обработки.ПомощникФормированияКУДиР.УстановитьСписокОрганизацийНаУСНЗаПериод(СписокОрганизаций, НачалоПериода, КонецПериода, ТекущаяОрганизация);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписковФормы(Форма)
	
	Если Форма.Период.ДатаНачала > Форма.Период.ДатаОкончания Тогда
		СтрокаСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода'");
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения, , "Период.ДатаНачала");
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения, , "Период.ДатаНачала");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Форма.СписокДокументов.Отбор, "Организация", Форма.Объект.Организация);
	Форма.СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Форма.Период.ДатаНачала);
	Форма.СписокДокументов.Параметры.УстановитьЗначениеПараметра("КонецПериода", Форма.Период.ДатаОкончания);
	ИспользованиеОтборПодразделение = ЗначениеЗаполнено(Форма.ОтборПодразделение);
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Форма.СписокДокументов.Отбор, "Подразделение", Форма.ОтборПодразделение, , ИспользованиеОтборПодразделение);
	ИспользованиеОтборОтветственный = ЗначениеЗаполнено(Форма.ОтборОтветственный);
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Форма.СписокДокументов.Отбор, "Ответственный", Форма.ОтборОтветственный, , ИспользованиеОтборОтветственный);
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Форма.СписокДокументов.Отбор, "Патент", , , Ложь);
	
	ОбновитьОтборыПоПатентам(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборСписковФормы(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОтборыПоПатентам();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура("Организация", Объект.Организация);
	МассивСторно = СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры);
	Если Результат <> Неопределено И МассивСторно.Количество() = 1 Тогда
		СтруктураСторно = МассивСторно.Получить(0);
		СтруктураСторно["ДоходПатент"] = СтруктураСторно["ДоходПатент"]+Результат;
		Если СтруктураСторно.Графа5 > 0 Тогда
			СтруктураСторно.Графа5 = СтруктураСторно.Графа5 - Результат;
		КонецЕсли;
		Если СтруктураСторно.ДоходЕНВД > 0 Тогда
			СтруктураСторно.ДоходЕНВД = СтруктураСторно.ДоходЕНВД - Результат;
		КонецЕсли;
		СтруктураСторно["Графа4"] = 0;
		ДанныеДляЗаполнения.Вставить("Дата", СтруктураСторно.Период);
		ДанныеДляЗаполнения.Вставить("Строки", МассивСторно);
		
		ПараметрыЗаписи = Новый Структура("Основание", ДанныеДляЗаполнения);
		
		ОткрытьФорму("Документ.ЗаписьКУДиР.ФормаОбъекта", ПараметрыЗаписи, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПатентЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура("Организация", Объект.Организация);
	МассивСторно = СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры);
	Если ЗначениеЗаполнено(Результат) И МассивСторно.Количество() = 1 Тогда
		СтруктураСторно = МассивСторно.Получить(0);
		СтруктураНовогоПатента = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(СтруктураСторно);
		СтруктураНовогоПатента["Патент"] = Результат;
		СтруктураНовогоПатента.Графа4 = -СтруктураСторно.Графа4;
		СтруктураНовогоПатента.Графа5 = -СтруктураСторно.Графа5;
		СтруктураНовогоПатента.ДоходЕНВД = -СтруктураСторно.ДоходЕНВД;
		СтруктураНовогоПатента.ДоходПатент = -СтруктураСторно.ДоходПатент;
		МассивСторно.Добавить(СтруктураНовогоПатента);
		
		ДанныеДляЗаполнения.Вставить("Дата", СтруктураСторно.Период);
		ДанныеДляЗаполнения.Вставить("Строки", МассивСторно);
		
		ПараметрыЗаписи = Новый Структура("Основание", ДанныеДляЗаполнения);
		
		ОткрытьФорму("Документ.ЗаписьКУДиР.ФормаОбъекта", ПараметрыЗаписи, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры)
	ДополнительныеПараметрыСторнирования = Новый Структура;
	ДополнительныеПараметрыСторнирования.Вставить("Регистратор", ДополнительныеПараметры.КлючЗаписи.Регистратор);
	Если ДополнительныеПараметры.Свойство("ДокументВозникновенияДоходов") Тогда
		ДополнительныеПараметрыСторнирования.Вставить("ДокументВозникновенияДоходовРасходов", ДополнительныеПараметры.ДокументВозникновенияДоходов);
	КонецЕсли;
	Если ДополнительныеПараметры.Свойство("Патент") Тогда
		ДополнительныеПараметрыСторнирования.Вставить("Патент", ДополнительныеПараметры.Патент);
	КонецЕсли;
	Возврат УчетУСНПСНСервер.СторноЗаписейКУДиРПоОтбору(ДополнительныеПараметрыСторнирования);
КонецФункции

&НаКлиенте
Процедура ВыборПатента(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	Если Результат <> Неопределено Тогда
		УстановитьОтборПоПатенту(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияОтборыПоПатентам()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	РезультатВыполнения = РезультатВыполнения(ИдентификаторЗадания, АдресХранилища);
	Если РезультатВыполнения <> Неопределено Тогда
		
		ОбновитьОтборыПоПатентамЗавершение(ЭтотОбъект, РезультатВыполнения);
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатВыполнения(ИдентификаторЗадания, АдресХранилища)
	
	Если ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
		Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборыПоПатентам(Форма)
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("Организация", Форма.Объект.Организация);
	ПараметрыФормирования.Вставить("НачалоПериода", Форма.Период.ДатаНачала);
	ПараметрыФормирования.Вставить("КонецПериода", Форма.Период.ДатаОкончания);
	ПараметрыФормирования.Вставить("Подразделение", Форма.ОтборПодразделение);
	ПараметрыФормирования.Вставить("Ответственный", Форма.ОтборОтветственный);
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ПараметрыФормирования);
	
	РезультатРасчета = ЗапуститьВыполнениеЗадания(Форма.УникальныйИдентификатор, ПараметрыЗадания);
	
	Форма.АдресХранилища = РезультатРасчета.АдресРезультата;
	Форма.ИдентификаторЗадания = РезультатРасчета.ИдентификаторЗадания;
	
	Если РезультатРасчета.Статус = "Выполнено" Тогда
		ОбновитьОтборыПоПатентамЗавершение(Форма, РезультатРасчета.РезультатВыполнения);
	Иначе
		Форма.ОбщиеНастройкиПатентов = Неопределено;
		Форма.СписокПатентов.Очистить();
		Форма.СтрокаВыбораПатента = СтрокаВыбораПатента(Форма.ОбщиеНастройкиПатентов, Форма.СписокПатентов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьВыполнениеЗадания(УникальныйИдентификатор, ПараметрыЗадания)
	
	ПроцедураРасчета = "Обработки.ПомощникФормированияКУДиР.КоличествоДокументовПоПатентам";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	РезультатРасчета = ДлительныеОперации.ВыполнитьВФоне(ПроцедураРасчета, ПараметрыЗадания, ПараметрыВыполнения);
	
	Если РезультатРасчета.Статус = "Выполнено" Тогда
		Результат = ПолучитьИзВременногоХранилища(РезультатРасчета.АдресРезультата);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	РезультатРасчета.Вставить("РезультатВыполнения", Результат);
	
	Возврат РезультатРасчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборыПоПатентамЗавершение(Форма, Результат)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ОбщиеНастройкиПатентов = Новый Структура;
	Форма.ОбщиеНастройкиПатентов.Вставить("БезПатента", 0);
	Форма.ОбщиеНастройкиПатентов.Вставить("ВсеДокументы", 0);
	Форма.ОбщиеНастройкиПатентов.Вставить("СПатентом", 0);
	
	Для каждого КоличествоПатентов Из Результат Цикл
		
		Если ТипЗнч(КоличествоПатентов.Ключ) = Тип("СправочникСсылка.Патенты") Тогда
			// Добавим текущее количество патентов в список значений, так как это данные по конкретному патенту
			Представление = СтрШаблон(НСтр("ru = '%1 (%2)'"), КоличествоПатентов.Ключ, КоличествоПатентов.Значение);
			Форма.СписокПатентов.Добавить(КоличествоПатентов.Ключ, Представление);
		Иначе
			Форма.ОбщиеНастройкиПатентов.Вставить(КоличествоПатентов.Ключ, КоличествоПатентов.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ИдентификаторЗадания = Неопределено;
	
	Форма.СтрокаВыбораПатента = СтрокаВыбораПатента(Форма.ОбщиеНастройкиПатентов, Форма.СписокПатентов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаВыбораПатента(ОбщиеНастройкиПатента, СписокПатентов, ВыбранныйПатент = Неопределено)
	
	Если ОбщиеНастройкиПатента = Неопределено Тогда
		Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'Быстрые отборы: <идет обновление данных>'"), , ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	
	Если ОбщиеНастройкиПатента.ВсеДокументы = 0 Тогда
		СтрокаСообщения = НСтр("ru = 'Нет документов соответствующим выбранным настройкам'");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветаСтиля.НедоступныеДанныеЦвет));
	ИначеЕсли ОбщиеНастройкиПатента.ВсеДокументы = ОбщиеНастройкиПатента.БезПатента Тогда
		СтрокаСообщения = СтрШаблон(НСтр("ru = 'Все документы без патента: %1'"), ОбщиеНастройкиПатента.БезПатента);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветаСтиля.ТекстИнформационнойНадписи));
	ИначеЕсли ОбщиеНастройкиПатента.ВсеДокументы = ОбщиеНастройкиПатента.СПатентом И СписокПатентов.Количество() = 1 Тогда
		СтрокаСообщения = НСтр("ru = 'Все документы по патенту:'");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветаСтиля.ТекстИнформационнойНадписи));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" ", , ЦветаСтиля.ТекстИнформационнойНадписи));
		Патент = СписокПатентов.Получить(0);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Патент.Представление, , , , ПолучитьНавигационнуюСсылку(Патент.Значение)));
	ИначеЕсли ОбщиеНастройкиПатента.ВсеДокументы = ОбщиеНастройкиПатента.СПатентом Тогда
		СтрокаСообщения = СтрШаблон(НСтр("ru = 'Все документы с патентом: %1'"), ОбщиеНастройкиПатента.СПатентом);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , , , "ВыбратьСПатентом"));
	Иначе
		СтрокаСообщения = СтрШаблон(НСтр("ru = 'Все документы (%1)'"), ОбщиеНастройкиПатента.ВсеДокументы);
		ЦветСообщения = ?(ВыбранныйПатент = Неопределено, ЦветаСтиля.ЦветТекстаИспользованнаяГиперссылкаБЭД, Неопределено);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветСообщения, , "ВыбратьВсеДокументы"));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("   ", , ЦветаСтиля.ТекстИнформационнойНадписи));
		СтрокаСообщения = СтрШаблон(НСтр("ru = 'Без патента (%1)'"), ОбщиеНастройкиПатента.БезПатента);
		ЦветСообщения = ?(ВыбранныйПатент = "БезПатента", ЦветаСтиля.ЦветТекстаИспользованнаяГиперссылкаБЭД, Неопределено);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветСообщения, , "ВыбратьБезПатента"));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("   ", , ЦветаСтиля.ТекстИнформационнойНадписи));
		СтрокаСообщения = СтрШаблон(НСтр("ru = 'С патентом (%1)'"), ОбщиеНастройкиПатента.СПатентом);
		ЦветСообщения = ?(ВыбранныйПатент = "СПатентом", ЦветаСтиля.ЦветТекстаИспользованнаяГиперссылкаБЭД, Неопределено);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветСообщения, , "ВыбратьСПатентом"));
	КонецЕсли;
	
	Если СписокПатентов.Количество() > 3 Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("   ", , ЦветаСтиля.ТекстИнформационнойНадписи));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Выбрать патент...'"),,,, "ОткрытьВыборИзСписка"));
	ИначеЕсли СписокПатентов.Количество() > 1 Тогда
		Для каждого ЗначениеЭлемента Из СписокПатентов Цикл
			Выбран = ВыбранныйПатент <> Неопределено И ТипЗнч(ВыбранныйПатент) <> Тип("Строка") И ВыбранныйПатент = СписокПатентов.Индекс(ЗначениеЭлемента);
			ЦветСообщения = ?(Выбран, ЦветаСтиля.ЦветТекстаИспользованнаяГиперссылкаБЭД, Неопределено);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока("   ", , ЦветаСтиля.ТекстИнформационнойНадписи));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЗначениеЭлемента.Представление,, ЦветСообщения,, "ВыбратьПатент" + СписокПатентов.Индекс(ЗначениеЭлемента)));
		КонецЦикла;
	КонецЕсли;
	
	Если ВыбранныйПатент <> Неопределено И ТипЗнч(ВыбранныйПатент) <> Тип("Строка") И СписокПатентов.Количество() > 3 Тогда
		СтрокаСообщения = НСтр("ru = 'Показаны документы по патенту'");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("   ", , ЦветаСтиля.ТекстИнформационнойНадписи));
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаСообщения, , ЦветаСтиля.ТекстИнформационнойНадписи));
		МассивСтрок.Добавить(" ");
		ЭлементСпискаПатентов = СписокПатентов.Получить(ВыбранныйПатент);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлементСпискаПатентов.Представление,,,, ПолучитьНавигационнуюСсылку(ЭлементСпискаПатентов.Значение)));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоПатенту(ЭлементСпискаЗначений)
	
	СтрокаВыбораПатента = СтрокаВыбораПатента(ОбщиеНастройкиПатентов, СписокПатентов, СписокПатентов.Индекс(ЭлементСпискаЗначений));
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументов.Отбор, "Патент", ЭлементСпискаЗначений.Значение, , Истина);
	
КонецПроцедуры

#КонецОбласти
